nxcuong/hydra.github.io/hardware/avr/1.0.0/variants/hydra50/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#define NUM_DIGITAL_PINS            70
#define NUM_ANALOG_INPUTS           16
#define analogInputToDigitalPin(p)  ((p < 16) ? (p) + 54 : -1)
#define digitalPinHasPWM(p)         (((p) >= 2 && (p) <= 13) || ((p) >= 44 && (p)<= 46))

//Hydra50 by Demen TCEngineering co., ltd
//Hydra50 pins definition
//Digital inputs pins
/*1.	status of digital outputs from 0-15
		two digital outputs have one status pins
		For example DO_0 and DO_1 have a status pin pinST_0
*/
#define pinStAuxRelay	(41)	//status pin of auxilary relay
#define pinCAN1INT		(20)	//interrupt of CAN bus 1
#define pinCAN2INT		(21)	//interrupt of CAN bus 2

#define pinStDO0		(22)	//status pin of DO0 & DO1
#define pinStDO2		(23)	//status pin of DO2 & DO3
#define pinStDO4		(24)	//status pin of DO4 & DO5
#define pinStDO6		(25)	//status pin of DO6 & DO7
#define pinStDO8		(26)	//status pin of DO8 & DO9
#define pinStDO10		(27)	//status pin of DO10 & DO10
#define pinStDO12		(28)	//status pin of DO12 & DO13
#define pinStDO14		(29)	//status pin of DO14 & DO15

//======================================define feedback of current PWM control channels
//signal of overheat
//digital input from 0- 9 <> I0 to I9
//should be definition like this
#define pinStPWM0 (38)
#define pinStPWM1 (39)
#define pinStPWM2 (36)
#define pinStPWM3 (37)
#define pinStPWM4 (34)
#define pinStPWM5 (31)
#define pinStPWM6 (30)
#define pinStPWM7 (33)
#define pinStPWM8 (32)
#define pinStPWM9 (35)

//define of analog current feedback of 8 Power Switch DO 2.0 - 2.7
#define pinISenseDO16  (54)
#define pinISenseDO17  (55)
#define pinISenseDO18  (56)
#define pinISenseDO19  (57)
#define pinISenseDO20  (58)
#define pinISenseDO21  (59)
#define pinISenseDO22  (60)
#define pinISenseDO23  (61)

//============================================Digital output==================================
#define pinMainSwitch 40 //pin 40 main power switch

//define of pin CS for all SPI communication
#define pinIOCS0 (62) //A8 //chip select expantion IO 0 >> respond for 16 channels 24V digital input
#define pinIOCS1 (63) //A9 //CS for IO1 - gate HS 1-8 channels & status 9 - 16
#define pinIOCS2 (64) //A10 //CS for IO2 - gate HS 1 - 16 of 16DOs
#define pinADCCS1 (65) //A11 //ADC1 current sense 1-8 pwm mosfets
#define pinADCCS2 (66) //A12 //ADC2 current sense 9-10 pwm mosfets, analog in 1-6 channels
#define pinCANCS1 (67) //A13 //canbus 1
#define pinCANCS2 (68) //A14 //canbus 2

// Define pwm firer channels to control IPWMs 0 - 9
//they are will firering mosfet gate to control valves
#define pinPWM0		(2) //ocr3b
#define pinPWM1		(3) //ocr3c
#define pinPWM2		(5) //ocr3a
#define pinPWM3		(6) //ocr4a
#define pinPWM4		(7) //ocr4b
#define pinPWM5		(8) //ocr4c
#define pinPWM6		(46) //ocr5a
#define pinPWM7		(45) //ocr5b
#define pinPWM8		(44) //ocr5c
#define pinPWM9		(11)   //ocr1a, we recommend to use as ON/OFF output
//====================================

#if defined(HYDRA50)
static const uint8_t stAuxRelay = pinStAuxRelay;
static const uint8_t CAN1INT = pinCAN1INT;
static const uint8_t CAN2INT = pinCAN2INT;
//====================================
static const uint8_t stDO0 = pinStDO0;
static const uint8_t stDO2 = pinStDO2;
static const uint8_t stDO4 = pinStDO4;
static const uint8_t stDO6 = pinStDO6;
static const uint8_t stDO8 = pinStDO8;
static const uint8_t stD10 = pinStD10;
static const uint8_t stD12 = pinStD12;
static const uint8_t stD14 = pinStD14;
//====================================
static const uint8_t stPWM0 = pinStPWM0;
static const uint8_t stPWM1 = pinStPWM1;
static const uint8_t stPWM2 = pinStPWM2;
static const uint8_t stPWM3 = pinStPWM3;
static const uint8_t stPWM4 = pinStPWM4;
static const uint8_t stPWM5 = pinStPWM5;
static const uint8_t stPWM6 = pinStPWM6;
static const uint8_t stPWM7 = pinStPWM7;
static const uint8_t stPWM8 = pinStPWM8;
static const uint8_t stPWM9 = pinStPWM9;
//=====================================
static const uint8_t iSenseDO16 = pinISenseDO16;
static const uint8_t iSenseDO17 = pinISenseDO17;
static const uint8_t iSenseDO18 = pinISenseDO18;
static const uint8_t iSenseDO19 = pinISenseDO19;
static const uint8_t iSenseDO20 = pinISenseDO20;
static const uint8_t iSenseDO21 = pinISenseDO21;
static const uint8_t iSenseDO22 = pinISenseDO22;
static const uint8_t iSenseDO23 = pinISenseDO23;
//==============================================
static const uint8_t mainSwitch = pinMainSwitch;
static const uint8_t IOCS0 = pinIOCS0;
static const uint8_t IOCS1 = pinIOCS1;
static const uint8_t IOCS2 = pinIOCS2;
static const uint8_t ADCCS1 = pinADCCS1;
static const uint8_t ADCCS2 = pinADCCS2;
static const uint8_t CANCS1 = pinCANCS1;
static const uint8_t CANCS2 = pinCANCS2;
//==============================================
static const uint8_t gatePWM0 = pinPWM0;
static const uint8_t gatePWM1 = pinPWM1;
static const uint8_t gatePWM2 = pinPWM2;
static const uint8_t gatePWM3 = pinPWM3;
static const uint8_t gatePWM4 = pinPWM4;
static const uint8_t gatePWM5 = pinPWM5;
static const uint8_t gatePWM6 = pinPWM6;
static const uint8_t gatePWM7 = pinPWM7;
static const uint8_t gatePWM8 = pinPWM8;
static const uint8_t gatePWM9 = pinPWM9;
#endif

//============================================================================
//============================================================================
//Orignal arduino definition
#define PIN_SPI_SS    (53)
#define PIN_SPI_MOSI  (51)
#define PIN_SPI_MISO  (50)
#define PIN_SPI_SCK   (52)

